practice-for-ch-rails-first-routes-long-practice-main/first-routes/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kyle"], ["email", "kyle@example.com"], ["created_at", "2023-08-02 20:53:49.573527"], ["updated_at", "2023-08-02 20:53:49.573527"]]